---
kind: enumMember
id: F:Autodesk.Revit.DB.AdaptivePointConstraintType.Plane_YZ
enum: Autodesk.Revit.DB.AdaptivePointConstraintType
source: html/9aa479aa-36be-bf1b-7570-026afcd4d02e.htm
---
# Autodesk.Revit.DB.AdaptivePointConstraintType.Plane_YZ

Constrained to the YZ Plane (x=0).